#使用ggplot2绘图
#第一步, 加载ggplot2库
#第二步, 准备数据
#第三步, 绘图

#加载ggplot2包
library(ggplot2)

# 准备数据
x <- c(6.800000191, 7.5,6.900000095,6.099999905,5.599999905,
       5.400000095,4.900000095,4.5,4.199999809,4,4.699999809,
       5.800000191,6,5.5,5.099999905,4.599999905,4.599999905,
       5.800000191,9.300000191,9.600000381,8.899999619,
       8.100000381,7.400000095,6.199999809,
       5.300000191,4.906000137)
y <- c(-0.074084531, 3.555396148, 2.745856719, 4.037643425,
      2.718975789, 3.795881229, 4.487026493, 4.449910963,
      4.685199608, 4.092176449, 0.975981834, 1.786127687,
      2.806775956, 3.78574285, 3.345216063, 2.666625826,
      1.77857024, -0.291621459, -2.775529574, 2.531920616,
      1.601454672, 2.224030854, 1.67733153, 2.370457671,
      2.596148041, 1.61565606)
df <- data.frame(x,y)

# 使用geom_point画散点图
p <- ggplot(df,aes(x,y,size = y,color = x))  # 这里的color 的需要解释， 这里的那x,y确定了将画的图的坐标轴的名 ?
p1 <- p + geom_point(shape = 19,alpha = 0.5)
p2 <- p1 + geom_smooth(method = lm, fill = 'lightblue', color = 'darkblue',size = 1)  # 如何设置坐标名称 ?
p2_1 <- p1 + geom_smooth(method = loess, fill = 'lightblue', color = 'darkblue',size = 1)

# 使用geom_bar画条形图
t <- 1991:2016
gfd <- data.frame(x,t)
q <- ggplot(df,aes(t,x,fill = x))
q1 <- q + geom_bar(stat = 'identity')

x11()             # 如何使RStudio打开哪图像 ?



#参考
# 1. 无涯. R语言(ggplot2绘图) https://wklchris.github.io/R-ggplot2.html. 07-2017.
# 2. Why & How. 用ggplot2绘图 (三) https://www.longqi.cf/ggplot/2015/04/05/ggplot3/. 07-2017.
